README.md
```mermaid
%%{init: {'theme': 'base', 'themeVariables': {'fontSize': '0.9em'}}}%%
graph LR
    worker("fa:fa-user Worker")
    worker --> create_user("ユーザーを登録する")
    worker --> upate_user("ユーザーを更新する")
    worker --> delete_user("ユーザーを削除する")
    worker --> get_user("ユーザーを取得する")
    worker --> list_user("ユーザー一覧を取得する")

    worker -.- comment1("comment1 comment1")
    
    worker -.- comment2("comment2 comment2")

    subgraph "User's Usecase"
        create_user
        upate_user
        delete_user
        get_user
        list_user
    end
```
